Revit 2024 API
AnalysisDisplayDeformedShapeSettings Constructor (AnalysisDisplayDeformedShapeSettings)
 Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public AnalysisDisplayDeformedShapeSettings(
	AnalysisDisplayDeformedShapeSettings other
)
Visual Basic
Public Sub New ( _
	other As AnalysisDisplayDeformedShapeSettings _
)
Visual C++
public:
AnalysisDisplayDeformedShapeSettings(
	AnalysisDisplayDeformedShapeSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalysisDisplayDeformedShapeSettings Class
AnalysisDisplayDeformedShapeSettings Overload
Autodesk.Revit.DB.Analysis Namespace